# ЗАДАЧА 1.
# Инженер ежедневно приезжал на станцию в одно и то же время, 
# и в то же время за ним подъезжала машина,
# на которой он ехал на завод.
# Однажды инженер приехал на станцию на 55 мин раньше
# обычного.
# Сразу пошел навстречу машине и приехал на завод на
# 10 мин раньше,
# чем обычно.
# Во сколько раз скорость инженера меньше скорости машины?

# ЗАДАЧА 2.
# В триседьмом царстве живут драконы.
# У каждого дракона одна, две или три головы:
# a) Может ли у 40% драконов быть 60% голов?
# б) Может ли у 40% драконов быть 70% голов?

# ЗАДАЧА 3.
# Про вещественные числа a,b,c известно, что:
# a*b*c + a + b + c = 10
# a*b + b*c + a*c = 9
# Для каких чисел X можно утверждать, что хотя бы одно из чисел
# a,b,c равно X? Найти все эти X и доказать, что других нет.
