# ЗАДАНИЕ
# Пользователь вводит целое число A (< 100).
# Требуется вывести квадраты всех чисел, заключенных
# в диапазоне от A до 100 включительно.

# Пример работы:
# Ввод                                              # Вывод
# 98                                                9604
#                                                   9801
#                                                   10000

start = 0
while start < 10:
    print(start)
    start  = start + 1
print("ALLES")